tests/performance/results/auto_small_summary_20260519_103340.txt

Summary:
  Total:	5.2801 secs
  Slowest:	2.6374 secs
  Fastest:	0.4251 secs
  Average:	0.7338 secs
  Requests/sec:	18.9391
  

Response time histogram:
  0.425 [1]	|■
  0.646 [54]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.868 [23]	|■■■■■■■■■■■■■■■■■
  1.089 [3]	|■■
  1.310 [17]	|■■■■■■■■■■■■■
  1.531 [1]	|■
  1.752 [0]	|
  1.974 [0]	|
  2.195 [0]	|
  2.416 [0]	|
  2.637 [1]	|■


Latency distribution:
  10%% in 0.4790 secs
  25%% in 0.5073 secs
  50%% in 0.6091 secs
  75%% in 0.7926 secs
  90%% in 1.2544 secs
  95%% in 1.2944 secs
  99%% in 2.6374 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0004 secs, 0.0000 secs, 0.0028 secs
  DNS-lookup:	0.0002 secs, 0.0000 secs, 0.0012 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0004 secs
  resp wait:	0.7332 secs, 0.4249 secs, 2.6371 secs
  resp read:	0.0001 secs, 0.0001 secs, 0.0004 secs

Status code distribution:
  [200]	100 responses