tests/performance/results/medium_summary_20260519_103340.txt

Summary:
  Total:	0.0531 secs
  Slowest:	0.0276 secs
  Fastest:	0.0004 secs
  Average:	0.0053 secs
  Requests/sec:	3766.9376
  
  Total data:	19200 bytes
  Size/request:	96 bytes

Response time histogram:
  0.000 [1]	|
  0.003 [82]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.006 [54]	|■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.009 [29]	|■■■■■■■■■■■■■■
  0.011 [16]	|■■■■■■■■
  0.014 [6]	|■■■
  0.017 [2]	|■
  0.019 [3]	|■
  0.022 [2]	|■
  0.025 [2]	|■
  0.028 [3]	|■


Latency distribution:
  10%% in 0.0010 secs
  25%% in 0.0017 secs
  50%% in 0.0036 secs
  75%% in 0.0071 secs
  90%% in 0.0104 secs
  95%% in 0.0172 secs
  99%% in 0.0270 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0002 secs, 0.0000 secs, 0.0028 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0016 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0019 secs
  resp wait:	0.0049 secs, 0.0003 secs, 0.0276 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0005 secs

Status code distribution:
  [503]	200 responses