tests/performance/results/quick_small_summary_20260519_103252.txt

Summary:
  Total:	0.0241 secs
  Slowest:	0.0192 secs
  Fastest:	0.0004 secs
  Average:	0.0037 secs
  Requests/sec:	2070.5116
  
  Total data:	4800 bytes
  Size/request:	96 bytes

Response time histogram:
  0.000 [1]	|■■
  0.002 [23]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.004 [10]	|■■■■■■■■■■■■■■■■■
  0.006 [5]	|■■■■■■■■■
  0.008 [4]	|■■■■■■■
  0.010 [4]	|■■■■■■■
  0.012 [1]	|■■
  0.014 [1]	|■■
  0.015 [0]	|
  0.017 [0]	|
  0.019 [1]	|■■


Latency distribution:
  10%% in 0.0007 secs
  25%% in 0.0012 secs
  50%% in 0.0026 secs
  75%% in 0.0051 secs
  90%% in 0.0088 secs
  95%% in 0.0123 secs
  0%% in 0.0000 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0008 secs, 0.0000 secs, 0.0068 secs
  DNS-lookup:	0.0005 secs, 0.0000 secs, 0.0038 secs
  req write:	0.0003 secs, 0.0000 secs, 0.0016 secs
  resp wait:	0.0022 secs, 0.0003 secs, 0.0084 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0003 secs

Status code distribution:
  [503]	50 responses