tests/performance/results/quick_small_summary_20260519_103340.txt

Summary:
  Total:	0.0133 secs
  Slowest:	0.0078 secs
  Fastest:	0.0003 secs
  Average:	0.0020 secs
  Requests/sec:	3745.4334
  
  Total data:	4800 bytes
  Size/request:	96 bytes

Response time histogram:
  0.000 [1]	|■■
  0.001 [18]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [12]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.003 [5]	|■■■■■■■■■■■
  0.003 [7]	|■■■■■■■■■■■■■■■■
  0.004 [4]	|■■■■■■■■■
  0.005 [0]	|
  0.006 [1]	|■■
  0.006 [0]	|
  0.007 [0]	|
  0.008 [2]	|■■■■


Latency distribution:
  10%% in 0.0006 secs
  25%% in 0.0009 secs
  50%% in 0.0015 secs
  75%% in 0.0030 secs
  90%% in 0.0036 secs
  95%% in 0.0077 secs
  0%% in 0.0000 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0008 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0005 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0011 secs
  resp wait:	0.0016 secs, 0.0003 secs, 0.0072 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0003 secs

Status code distribution:
  [503]	50 responses